Public Attributes | List of all members
API_GetPolyType Struct Reference
User input management
Parameters of the polygon input operation. More...
#include <APIdefs_Interface.h>
 Public Attributes
char  | prompt [256]
[in] Prompt string to be displayed in the control box during input
bool  | changeCursorSet
[in] Use the cursorSet field for changing cursor forms
bool  | changePlane
[in] Use the startCoord and planeNormal fields for defining the input plane
bool  | disableDefaultFeedback
[in] Disable the default polygon drawing feedback
bool  | getZCoords
[in] Retrieve z coordinates in case of 3D input
API_PolyGetMethod  | method
[in] The polygon input method
API_CursorSet  | cursorSet
[in] Cursor set for customized visual feedback
API_Vector3D  | planeNormal
[in] The normal vector of the input plane
API_Coord3D  | startCoord
[in] The start coordinate of the polygon
API_Coord **  | coords
[out] The polygon coordinates (projected vertically to the input plane), indexed from 1 to nCoords. The first coordinate is the same as the last one
API_PolyArc **  | parcs
[out] The polygon arcs segments, indexed from 1 to nArcs
Int32  | nCoords
[out] The number of the polygon coordinates
Int32  | nArcs
[out] The number of curves in the polygon
API_Neig  | neig
[out] The closing neig of the polygon
double **  | zCoords
[out] Handle containing the z coordinates of the correspondong polygon nodes (retrieved only on demand by passing true in getZCoords)
bool  | polylineWas
[out] Polyline contour has been entered
bool  | useStandardPetPalette
[out] Use standard polygon input palette
Detailed Description
Parameters of the polygon input operation.
Remarks
For the utilization of API_GetPolyType see the ACAPI_UserInput_GetPoly function.
Member Data Documentation
◆ changeCursorSet
 API_GetPolyType::changeCursorSet
[in] Use the cursorSet field for changing cursor forms
◆ changePlane
 API_GetPolyType::changePlane
[in] Use the startCoord and planeNormal fields for defining the input plane
◆ coords
 API_GetPolyType::coords
[out] The polygon coordinates (projected vertically to the input plane), indexed from 1 to nCoords. The first coordinate is the same as the last one
◆ cursorSet
 API_GetPolyType::cursorSet
[in] Cursor set for customized visual feedback
◆ disableDefaultFeedback
 API_GetPolyType::disableDefaultFeedback
[in] Disable the default polygon drawing feedback
◆ getZCoords
 API_GetPolyType::getZCoords
[in] Retrieve z coordinates in case of 3D input
◆ method
 API_GetPolyType::method
[in] The polygon input method
 Value  | Meaning
 APIPolyGetMethod_General  | Gets an arbitrary closed polygon
 APIPolyGetMethod_Rect  | Gets a rectangle
 APIPolyGetMethod_RotRect  | Gets a base vector then a rectangle perpendicular to it
 APIPolyGetMethod_Polyline  | Gets a polyline (can be open)
◆ nArcs
 API_GetPolyType::nArcs
[out] The number of curves in the polygon
◆ nCoords
 API_GetPolyType::nCoords
[out] The number of the polygon coordinates
◆ neig
 API_GetPolyType::neig
[out] The closing neig of the polygon
◆ parcs
 API_GetPolyType::parcs
[out] The polygon arcs segments, indexed from 1 to nArcs
◆ planeNormal
 API_GetPolyType::planeNormal
[in] The normal vector of the input plane
◆ polylineWas
 API_GetPolyType::polylineWas
[out] Polyline contour has been entered
◆ prompt
 API_GetPolyType::prompt
[in] Prompt string to be displayed in the control box during input
◆ startCoord
 API_GetPolyType::startCoord
[in] The start coordinate of the polygon
◆ useStandardPetPalette
 API_GetPolyType::useStandardPetPalette
[out] Use standard polygon input palette
◆ zCoords
 API_GetPolyType::zCoords
[out] Handle containing the z coordinates of the correspondong polygon nodes (retrieved only on demand by passing true in getZCoords)